# _________DARK_TEAM_LMNx9___
#_______Codder - Limon Hossain
# _____GitHub - LMNx9-JOHNY 
# 


import os, sys, time
P = '\x1b[0m'
H = '\x1b[91m'
G = '\x1b[92m'
K = '\x1b[93m'
print("\033[1;35m ")
os.system("apt update")
os.system("apt upgrade")
os.system("pkg install python2")
os.system("pkg install git")
os.system("pip install bs4")
os.system("pip install requests")
os.system('pip install mechanize')

#___________LMNx9----Logo_____________#

lj = """\033[1;36m 
\033[1;34m _      \033[1;33m _________ \033[1;32m_______ \033[1;36m _______ \033[1;35m _         
\033[1;34m( \     \033[1;33m \__   __/\033[1;32m(       )\033[1;36m(  ___  )\033[1;35m( (    /|  
\033[1;34m| (      \033[1;33m   ) (   \033[1;32m| () () |\033[1;36m| (   ) |\033[1;35m|  \  ( |  
\033[1;34m| |      \033[1;33m   | |   \033[1;32m| || || |\033[1;36m| |   | |\033[1;35m|   \ | |  
\033[1;34m| |       \033[1;33m  | |   \033[1;32m| |(_)| |\033[1;36m| |   | |\033[1;35m| (\ \) |  
\033[1;34m| |       \033[1;33m  | |   \033[1;32m| |   | |\033[1;36m| |   | |\033[1;35m| | \   |  
\033[1;34m| (_____ \033[1;33m___) (___\033[1;32m| )   ( |\033[1;36m| (___) |\033[1;35m| )  \  |  
\033[1;34m(_______/\033[1;33m\_______/\033[1;32m|/     \|\033[1;36m(_______)\033[1;35m|/    )_)  
\033[1;36m            \033[1;31m  ____     _____ 
\033[1;32m  - 𝙰𝚞𝚝𝚑𝚘𝚛   \033[1;31m`.   \  .'    / \033[1;32m- 𝙻𝚒𝚖𝚘𝚗 𝙷𝚘𝚜𝚜𝚊𝚒𝚗
\033[1;36m               \033[1;31m`.  `'    .' 
\033[1;36m------\033[1;31mＡＵＴＯ\033[1;36m---\033[1;31m'.    .'\033[1;36m---\033[1;31mＲＥＰＯＲＴ\033[1;36m-----
\033[1;32m----------------\033[1;31m.'      `.\033[1;32m-------------------
\033[1;36m  - 𝚃𝚎𝚕𝚎𝚐𝚛𝚊𝚖  \033[1;31m.'   .'`.   `.   \033[1;36m- @𝙳𝙰𝚁𝙺_𝙻𝙼𝙽𝚡𝟿
\033[1;36m  \033[1;35m- 𝙶𝚒𝚝𝙷𝚞𝚋  \033[1;31m.'   .'    `.   `. \033[1;35m- 𝙻𝙼𝙽𝚡𝟿-𝙹𝙾𝙷𝙽𝚈
\033[1;36m  \033[1;33m- 𝙳𝙰𝚁𝙺   \033[1;31m'----'\033[1;33m - 𝚃𝙴𝙰𝙼\033[1;31m '----'\033[1;33m- 𝙻𝙼𝙽𝚡𝟿
\033[1;35m_________ \033[1;36m_______ \033[1;32m         \033[1;33m _       \033[1;34m           
\033[1;35m\__    _/\033[1;36m(  ___  )\033[1;32m|\     /|\033[1;33m( (    /|\033[1;34m|\     /|  
\033[1;35m   )  (  \033[1;36m| (   ) |\033[1;32m| )   ( |\033[1;33m|  \  ( |\033[1;34m( \   / )  
\033[1;35m   |  |  \033[1;36m| |   | |\033[1;32m| (___) |\033[1;33m|   \ | |\033[1;34m \ (_) /   
\033[1;35m   |  |  \033[1;36m| |   | |\033[1;32m|  ___  |\033[1;33m| (\ \) |\033[1;34m  \   /    
\033[1;35m   |  |  \033[1;36m| |   | |\033[1;32m| (   ) |\033[1;33m| | \   |\033[1;34m   ) (     
\033[1;35m|\_)  )  \033[1;36m| (___) |\033[1;32m| )   ( |\033[1;33m| )  \  |\033[1;34m   | |     
\033[1;35m(____/   \033[1;36m(_______)\033[1;32m|/     \|\033[1;33m|/    )_)\033[1;34m   \_/     
"""

userlogo = """\033[1;31m
██████  ███████ ██████   ██████  ██████  ████████ 
██   ██ ██      ██   ██ ██    ██ ██   ██    ██    
██████  █████   ██████  ██    ██ ██████     ██    
██   ██ ██      ██      ██    ██ ██   ██    ██    
██   ██ ███████ ██       ██████  ██   ██    ██   

██    ██ ███████ ███████ ██████      
██    ██ ██      ██      ██   ██ \033[1;32mＤＡＲＫ         
\033[1;31m██    ██ ███████ █████   ██████ \033[1;32m ＴＥＡＭ
\033[1;31m██    ██      ██ ██      ██   ██ \033[1;32mＬＭＮｘ９   
\033[1;31m ██████  ███████ ███████ ██   ██     
                                                  
"""

pagelogo = """\033[1;31m
██████  ███████ ██████   ██████  ██████  ████████ 
██   ██ ██      ██   ██ ██    ██ ██   ██    ██    
██████  █████   ██████  ██    ██ ██████     ██    
██   ██ ██      ██      ██    ██ ██   ██    ██    
██   ██ ███████ ██       ██████  ██   ██    ██    
                                                  
██████   █████   ██████  ███████                  
██   ██ ██   ██ ██       ██     \033[1;32mＤＡＲＫ 
\033[1;31m██████  ███████ ██   ███ ████  \033[1;32m ＴＥＡＭ    
\033[1;31m██      ██   ██ ██    ██ ██     \033[1;32mＬＭＮｘ９      
\033[1;31m██      ██   ██  ██████  ███████                  
                                                  
"""

#__________LMNx9---Def--User___________#   


def user():
    os.system('clear')
    print(userlogo)
    input('\033[1;32m [+] \033[1;33mEnter Victim User Id :\033[1;32m ')
    time.sleep(2)
    os.system('clear')
    print(userlogo)
    print("\n\033[1;32m [*] \033[1;33mPlease Wait ! Report Precessing...")
    time.sleep(3)
    print("\n\033[1;32m [√] \033[1;31mReport Send Successful [01]")
    time.sleep(2)
    print("\n\033[1;32m [√]\033[1;31m Report Send Successful [02]")
    time.sleep(2)
    print("\n\033[1;32m [√]\033[1;31m Report Send Successful [03]")
    time.sleep(2)
    print("\n\033[1;32m [√]\033[1;31m Report Send Successful [04]")
    time.sleep(2)
    print("\n\033[1;32m [√] \033[1;31mReport Send Successful [05]")
    time.sleep(2)
    print("\n\033[1;32m [√] \033[1;31mReport Send Successful [06]")
    time.sleep(2)
    print("\n\033[1;32m [√]\033[1;31m Report Send Successful [07]")
    time.sleep(2)
    print("\n\033[1;32m [√] \033[1;31mReport Send Successful [08]")
    time.sleep(2)
    print("\n\033[1;32m [√] \033[1;31mReport Send Successful [09]")
    time.sleep(2)
    print("\n\033[1;32m [√]\033[1;31m Report Send Successful [10]")
    time.sleep(2)
    print("\n\n\033[1;32m [•] Report Send Complete !")
    print("\n\033[1;33m\n\tThanks For Use LMNx9 Tool")
    time.sleep(2)
    input("\n\t\033[1;36mPress Enter To Back Main")
    time.sleep(1)
    os.system("python LMNx9-Report.py")
    
    
#__________LMNx9---Def--Page___________#    
    
def page():
    os.system('clear')
    print(pagelogo)
    input('\033[1;32m [+] \033[1;33mEnter Page User Id :\033[1;32m ')
    time.sleep(2)
    os.system('clear')
    print(pagelogo)
    print("\n\033[1;32m [*] \033[1;33mPlease Wait ! Report Precessing...")
    time.sleep(3)
    print("\n\033[1;32m [√] \033[1;31mReport Send Successful [01]")
    time.sleep(2)
    print("\n\033[1;32m [√]\033[1;31m Report Send Successful [02]")
    time.sleep(2)
    print("\n\033[1;32m [√] \033[1;31mReport Send Successful [03]")
    time.sleep(2)
    print("\n\033[1;32m [√]\033[1;31m Report Send Successful [04]")
    time.sleep(2)
    print("\n\033[1;32m [√]\033[1;31m Report Send Successful [05]")
    time.sleep(2)
    print("\n\033[1;32m [√]\033[1;31m Report Send Successful [06]")
    time.sleep(2)
    print("\n\033[1;32m [√]\033[1;31m Report Send Successful [07]")
    time.sleep(2)
    print("\n\033[1;32m [√]\033[1;31m Report Send Successful [08]")
    time.sleep(2)
    print("\n\033[1;32m [√] \033[1;31mReport Send Successful [09]")
    time.sleep(2)
    print("\n\033[1;32m [√] \033[1;31mReport Send Successful [10]")
    time.sleep(2)
    print("\n\n\033[1;32m [•] Report Send Complete !")
    print("\n\033[1;33m\n\tThanks For Use LMNx9 Tool")
    time.sleep(2)
    input("\n\t\033[1;36mPress Enter To Back Main")
    time.sleep(1)
    os.system("python LMNx9-Report.py")
    
    
    
    
def option():
    print ("\n\t\033[1;32m--------------------")
    print ("\t\033[1;35m[\033[1;32m1\033[1;35m] 𝗥𝗲𝗽𝗼𝗿𝘁 \033[1;32m𝗙𝗕 \033[1;33m𝗨𝘀𝗲𝗿 ")
    print ("\t\033[1;35m[\033[1;32m2\033[1;35m] 𝗥𝗲𝗽𝗼𝗿𝘁 \033[1;32m𝗙𝗕 \033[1;33m𝗣𝗮𝗴𝗲 ")
    print ("\t\033[1;35m[\033[1;32m3\033[1;35m] 𝗥𝗲𝗽𝗼𝗿𝘁 \033[1;32m𝗧𝗼 \033[1;33m𝗔𝗱𝗺𝗶𝗻")
    print ("\t\033[1;35m[\033[1;32m4\033[1;35m] \033[1;31m𝗘𝘅𝗶𝘁 𝗧𝗼𝗼𝗹")
    print ("\t\033[1;32m--------------------")
    choice = input("\n\t\033[1;35m[\033[1;32m*\033[1;35m] 𝗖𝗵𝗼𝗶𝗰𝗲 :\033[1;32m ")
    
    if choice in ['01','1']:
        os.system('clear')
        print("\n\n\t\033[1;32mUser Report Launching...")
        time.sleep(3)
        user()
    
    if choice in ['02','2']:
        os.system('clear')
        print("\n\n\t\033[1;32mPage Report Launching...")
        time.sleep(3)
        page()
    
    if choice in ['03','3']:
        os.system("clear")
        print("\n\n\n\t\033[1;32m[*] LMNx9 Loading...")
        time.sleep(2)
        os.system("xdg-open https://facebook.com/LJ.LMNx9")
        input("\n\t\033[1;36mPress Enter To Back Main")
        time.sleep(1)
        os.system("python LMNx9-Report.py")
        
    if choice in ['04','4']:
        os.system('clear')
        print("\n\n\n\t\033[1;32m[*] Tool - LMNx9-Report\n\n\t\033[1;31m[*] Exiting...")
        time.sleep(2)
        exit()
       
def logo():
    print(lj)
    
    
    
#__________Main___________
os.system('clear')
print("\n\n\t\033[1;32m[√] Join My Telegram Group")
time.sleep(2.5)
os.system("xdg-open https://t.me/+YTU768eCwN1mYzdl")
os.system("clear")
logo()
option()
    